test/gpu-api-bzt.yaml
# bzt gpu-api-bzt.yaml
---
execution:
- concurrency: 2
  ramp-up: 120s
  # ramp-up: 180s
  hold-for: 30m
  # hold-for: 30m
  scenario: gpu-api

scenarios:
  gpu-api:
    think-time: 0
    requests:
    - https://gpu-api01-1715501333.ap-northeast-2.elb.amazonaws.com/gputest
    # - https://gpu-api02-1498873337.ap-northeast-2.elb.amazonaws.com/gputest